I've been doing some research around this and modified the provider to change the behavior but it looks like this is actually a problem that ultimately rests with the Azure API.

The following code creates a cluster with no addon profiles : 
```hcl
resource "azurerm_kubernetes_cluster" "test" {
  name                = "test"
  location            = "${azurerm_resource_group.test.location}"
  resource_group_name = "${azurerm_resource_group.test.name}"
  dns_prefix          = "test"

  linux_profile {
    admin_username = "test"
  }

  agent_pool_profile {
    name    = "default"
    count   = "1"
    vm_size = "Standard_DS2_v2"
  }

  service_principal {
    client_id     = "XXXXX"
    client_secret = "XXXXX"
  }
}
```

Running `terraform plan` will show the following:

```# azurerm_kubernetes_cluster.test will be created
  + resource "azurerm_kubernetes_cluster" "test" {
      + dns_prefix                 = "test"
      + enable_pod_security_policy = (known after apply)
      + fqdn                       = (known after apply)
      + id                         = (known after apply)
      + kube_admin_config          = (known after apply)
      + kube_admin_config_raw      = (sensitive value)
      + kube_config                = (known after apply)
      + kube_config_raw            = (sensitive value)
      + kubernetes_version         = (known after apply)
      + location                   = "southeastasia"
      + name                       = "test"
      + node_resource_group        = (known after apply)
      + resource_group_name        = "test"
      + tags                       = (known after apply)

      + addon_profile {
          + aci_connector_linux {
              + enabled     = (known after apply)
              + subnet_name = (known after apply)
            }

          + http_application_routing {
              + enabled                            = (known after apply)
              + http_application_routing_zone_name = (known after apply)
            }

          + kube_dashboard {
              + enabled = (known after apply)
            }

          + oms_agent {
              + enabled                    = (known after apply)
              + log_analytics_workspace_id = (known after apply)
            }
        }
        ...
    }
```

Note the `addon_profile` section that shows all values as computed (that doesn't happen if you provide at least one of the addons configuration).

Describing the cluster with the cli will by any mean show
 ```
    "addonProfiles": null,
```

After modifying the provider to send only the `enabled: false` value, you will by any mean get this error:
```
Error: Error creating/updating Managed Kubernetes Cluster "test" (Resource Group "test"): containerservice.ManagedClustersClient#CreateOrUpdate: Failure sending request: StatusCode=400 -- Original Error: Code="LinkedInvalidPropertyId" Message="Property id '' at path 'properties.addonProfiles.omsagent.config.logAnalyticsWorkspaceResourceID' is invalid. Expect fully qualified resource Id that start with '/subscriptions/{subscriptionId}' or '/providers/{resourceProviderNamespace}/'."
```

Basically, this is something that needs to be fixed at the API level before it can be fixed in the provider.